S02/Examples/caseParabolicVelocityTimeDependant/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
		
    INLET   
    {
		type 		parabolicVelocityTimeDependant;
		u0        	2.0;
		A        	0.5;
		omega        	2.0;
		radius         	0.5;
		origin        	(0 0 0);
		axis        	(1 0 0);
		value    uniform (0 0 0); 
    }
    OUTLET
    {
        type            zeroGradient;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
